; domain
(define (domain injured-people-environment)
    (:requirements :typing :equality :negative-preconditions :existential-preconditions :disjunctive-preconditions)
    (:types
        loc - object
        person - object
        crate - object
        food medicine - crate
        robot - object
    ) 
    (:constants agent - robot)
    (:predicates 
        
        ; localization predicates
        (robot_at ?r - robot ?l - loc)
        (person_at ?p - person ?l - loc)
        (crate_at ?c - crate ?l - loc)
        
        ; action-based predicates
        (has_crate ?p - person ?c - crate) ; person p has crate c
        (carrying ?r ?c) ; robot r is carrying crate c

        ; predicates expressing intrinsic properties of entities
        (free ?r) ; robot r is free, meaning it is not carrying any crate
    )

    ; move the robot ?r from location ?src to location ?dst
    (:action move
        :parameters (?r - robot ?src ?dst - loc)
        :precondition (and
            ; actual action constraints
            (robot_at ?r ?src) (not (= ?src ?dst))
        )
        :effect (and 
            (not (robot_at ?r ?src)) ; robot is not at the source location anymore
            (robot_at ?r ?dst) ; robot is at the destination location after moving
        )
    )

    ; load the crate ?c onto robot ?r at location ?l
    (:action load 
        :parameters (?r - robot ?c - crate ?l - loc)
        :precondition (and 
            (robot_at ?r ?l) (crate_at ?c ?l) ; location constraints
            (not (carrying ?r ?c)) (free ?r) ; ensure the robot can load the crate
        )
        :effect (and 
            (carrying ?r ?c) (not (free ?r)) ; the robot is actually holding the crate, so it is not free anymore
            (not (crate_at ?c ?l))
        )
    )

    ; deliver the content of crate ?c to person ?p from robot ?r when at the same location ?l
    (:action unload
        :parameters (?r - robot ?c - crate ?p - person ?l - loc)
        :precondition (and 
            (robot_at ?r ?l) (person_at ?p ?l) ; location constraints
            (carrying ?r ?c) ; make sure we are not trying to unload a crate we don't have!
        )
        :effect (and 
            (not (carrying ?r ?c)) (free ?r) ; the robot is not carrying the crate anymore, so it is free
            (has_crate ?p ?c) ; the crate has been delivered to the person
        )
    )
)

; problem
(define (problem problem_one) (:domain injured-people-environment)
(:objects 
    ; let's suppose 11 random locations directly connected to each other
    depot l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - loc
    ; let's suppose 3 people 
    alice wamiq zihadul matteo - person
    ; let's suppose 6 crates, 3 containing food and 3 containing medicine (subtypes of crate!)
    f0 f1 f2 - food
    m3 m4 m5 - medicine 
)

(:init
    ; let's suppose all People are in different locations
    (person_at wamiq l0)
    (person_at zihadul l5)
    (person_at alice l8)
    (person_at matteo l4)
    
    ; every crate as well as the agent are in the 'depot'
    (crate_at f0 depot) (crate_at f1 depot) (crate_at f2 depot) (crate_at m3 depot) (crate_at m4 depot) (crate_at m5 depot)
    (robot_at agent depot)
    
    ; in closed-world assumptions, we must mark the agent as free in the beginning. Otherwise, it cannot pick crates!
    (free agent)
)

(:goal (and
    ; >>> random definition of what people need >>>

    ; wamiq only needs food
    (or (has_crate wamiq f0) (has_crate wamiq f1) (has_crate wamiq f2))

    ; alternative definition with :existential-preconditions
    ; (exists (?c - food) (and (has_crate wamiq ?c)))

    ; zihadul only needs medicine
    (or (has_crate zihadul m3) (has_crate zihadul m4) (has_crate zihadul m5))

    ; alternative definition with :existential-preconditions
    ; (exists (?c - medicine) (and (has_crate zihadul ?c)))
    
    ; matteo doesn't need anything, so he mustn't be given any crate
    (not (or (has_crate matteo f0) (has_crate matteo f1) (has_crate matteo f2)))
    (not (or (has_crate matteo m3) (has_crate matteo m4) (has_crate matteo m5)))
    
    ; alternative definition with :existential-preconditions
    ; (not (exists (?c - food) (and (has_crate matteo ?c))))
    ; (not (exists (?c - medicine) (and (has_crate matteo ?c))))

    ; alice needs both food and medicine
    (or (has_crate alice m3) (has_crate alice m4) (has_crate alice m5))
    (or (has_crate alice f0) (has_crate alice f1) (has_crate alice f2))

    ; alternative definition with :existential-preconditions
    ; (exists (?c - medicine) (and (has_crate alice ?c)))
    ; (exists (?c - food) (and (has_crate alice ?c)))

    ; <<< random definition of what people need <<<
))

)

; plan
1. (load agent f1 depot)
   deleted: (free agent) (crate_at f1 depot)
   added: (carrying agent f1)
   goals met: 2 of 6
2. (move agent depot l8)
   deleted: (robot_at agent depot)
   added: (robot_at agent l8)
   goals met: 2 of 6
3. (unload agent f1 alice l8)
   deleted: (carrying agent f1)
   added: (free agent) (has_crate alice f1)
   goals met: 3 of 6
4. (move agent l8 depot)
   deleted: (robot_at agent l8)
   added: (robot_at agent depot)
   goals met: 3 of 6
5. (load agent f2 depot)
   deleted: (free agent) (crate_at f2 depot)
   added: (carrying agent f2)
   goals met: 3 of 6
6. (move agent depot l0)
   deleted: (robot_at agent depot)
   added: (robot_at agent l0)
   goals met: 3 of 6
7. (unload agent f2 wamiq l0)
   deleted: (carrying agent f2)
   added: (free agent) (has_crate wamiq f2)
   goals met: 4 of 6
8. (move agent l0 depot)
   deleted: (robot_at agent l0)
   added: (robot_at agent depot)
   goals met: 4 of 6
9. (load agent m3 depot)
   deleted: (free agent) (crate_at m3 depot)
   added: (carrying agent m3)
   goals met: 4 of 6
10. (move agent depot l5)
   deleted: (robot_at agent depot)
   added: (robot_at agent l5)
   goals met: 4 of 6
11. (unload agent m3 zihadul l5)
   deleted: (carrying agent m3)
   added: (free agent) (has_crate zihadul m3)
   goals met: 5 of 6
12. (move agent l5 depot)
   deleted: (robot_at agent l5)
   added: (robot_at agent depot)
   goals met: 5 of 6
13. (load agent m4 depot)
   deleted: (free agent) (crate_at m4 depot)
   added: (carrying agent m4)
   goals met: 5 of 6
14. (move agent depot l8)
   deleted: (robot_at agent depot)
   added: (robot_at agent l8)
   goals met: 5 of 6
15. (unload agent m4 alice l8)
   deleted: (carrying agent m4)
   added: (free agent) (has_crate alice m4)
   goals met: 6 of 6
